console.log('number' + 3 + 3);
//Результат: 'number33'
//Строка 'number' поєднується з числом 3 (конкатенація), далі знову з 3, результатом стає строка 'number33'.

console.log(null + 3);
//Результат: 3
//null перетворюється у число 0,  результат 0 + 3 = 3.

console.log(5 && 'qwerty');
//Результат: "qwerty"
//Логічний оператор && повертає останє справжнє значення, 5 та qwerty являються true, то повертає останнє "qwerty".

console.log(+'40' + +'2' + 'hillel');
//Результат: '42hillel'
//Унарний плюс перетворює строки '40' и '2' у числа. Сума 40 + 2 = 42, далі число конкатенується зі строкой 'hillel'.

console.log('10' - 5 === 6);
//Результат: false
//'10' перетворюється у число 10, та операція 10 - 5 = 5. Порівнення 5 === 6 повертає false.

console.log(true + false);
//Результат: 1
//Булєве значення перетворюється у числа: true → 1 та false → 0. Сума 1 + 0 = 1.

console.log('4px' - 3);
//NaN
//Операція віднімання потребує чисел. Так як '4px' не може бути перетвореним у число, результат — NaN.

console.log('4' - 3);
//Результат: 1
//'4' перетворюється у число 4. Операція 4 - 3 = 1.

console.log('6' + 3 ** 0);
//Результат: '61'
//Оператор ** вираховує ступень, 3 ** 0 = 1. Далі строка '6' з'єднюється з числом 1.

console.log(12 / '6');
//Результат: 2
//'6' перетворюється у число, 12 / 6 = 2.

console.log('10' + (5 === 6));
//Результат: '10false'
//Порівняння 5 === 6 повертає false. Строка '10' конкатенується зі строкой 'false'.

console.log(null == '');
//Результат: false
//null дорівнює тільки null або undefined. Порівнення з порожньою строкой повертає false.

console.log(3 ** (9 / 3));
//Результат: 27
//9 / 3 = 3, а 3 ** 3 = 27.

console.log(!!'false' == !!'true');
//Результат: true
//Оператор || робить строку булевим значенням. Будь-яка порожня строка ('false', 'true') стає true. Тому true == true.

console.log(0 || ('0' && 1));
//Результат: 1
//0 || '0' повертає строку '0', так як строка '0' є true. '0' && 1 повертає 1, так як оба значення true.

console.log((+null == false) < 1);
//Результат: false
//+null перетворюється у 0. 0 == false → true. true < 1 → false,так як true перетворюється до 1.

console.log((false && true) || true);
//Результат: true
//false && true повертає перше ложне значення false. false || true повертає true.

console.log(false && (false || true));
//Результат: false
//(false || true) повертає true. false && true повертає false.

console.log((+null == false) < 1 ** 5);
//Результат: false
//+null → 0. 0 == false → true. 1 ** 5 = 1. true < 1 → false.
